"Please Donate" = "Podpořte prosím tento projekt";
"Donate"="Podpořit!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Vývoj této aplikace zabralo mnoho bezesných nocí. Jestliže se Vám Cyberduck líbí, podpořte prosím autora.\nS Vaší pomocí se bude aplikace Cyberduck vyvíjet rychleji.";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Jako přispěvatel projektu Cyberduck, obdržíte klíč dárce, který zruší tuto výzvu.";

"Thank you for using Cyberduck!" = "Děkujeme Vám, že používáte aplikaci Cyberduck!";

"Later" = "Později";

"Don't show again for this version." = "V této verzi již nezobrazovat.";
"Registration Key" = "Klíč dárce";

